//=================================================================================================
//		File  Name	:	gateway.c
//		File  내용	:	gateway 연동 펌웨어
//=================================================================================================
//		gateway 관련 설정 및 동작 정의
//=================================================================================================
#include <gateway.h>

//=================================================================================================
void Gwid_Set(void)								// 게이트 웨이 ID 설정
{
	FND_Value_Data(0, 2, 12);						// FND 0 ~ 2 FND_OFF

	while(SET.Menu && SET.Select)						// 메뉴 와 선택 이 모두 1 이면 반복
	{
		DIGIT[0][3] = FND_G;						// FND 0 에 G-Id (국번)표시
		DIGIT[0][2] = FND_MINUS;
		DIGIT[0][1] = FND_I;
		DIGIT[0][0] = FND_d;

		DIGIT[1][1] = fnd_tbl[Gwid / 10];				// FND 1 에 게이트 웨이 ID 표시
		DIGIT[1][0] = fnd_tbl[Gwid % 10];

		if(KEY.Buff)							// Key 입력이 있으면
		{
			if     (KEY.Key == 1 && Gwid < 60) {Gwid++; KEY.Key = 0;}		// 업  버튼 이면 ID 60까지 증가
			else if(KEY.Key == 3 && Gwid > 1)  {Gwid--; KEY.Key = 0;}		// 다운버튼 이면 ID  0까지 감소
		}
		wdt_reset();							// 워치독 리셋
	}
	ee_write_byte(Gateway_GWID_Addr, Gwid);					// 게이트 웨이 ID 를 EEPROM 에 저장
}

//=================================================================================================
//		END OF "gateway.c"
//=================================================================================================
